xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    lv_obj_t *label_back = lv_label_create(btn_music_back); 
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    icon_flag = 2; // 标记已经进入第二个应用

    music_ui(); // 音乐播放器界面
}


/******************************** 第3个图标 SD卡 应用程序***************************************************************************/
lv_obj_t * sdcard_title; // SD卡页面标题背景
lv_obj_t * sdcard_label; // SD卡页面标题
lv_obj_t * sdcard_file_list; // SD卡文件列表
lv_obj_t * sdcard_preview_page; // 文件预览页面

#define SDCARD_PREVIEW_TOP 40
#define SDCARD_PREVIEW_W BSP_LCD_H_RES
#define SDCARD_PREVIEW_H (BSP_LCD_V_RES - SDCARD_PREVIEW_TOP)
#define SDCARD_TEXT_PREVIEW_LIMIT 4096
#define SDCARD_IMAGE_PREVIEW_LIMIT (2 * 1024 * 1024)

extern sdmmc_card_t *sdmmc_card;

struct file_path_info
{
    uint8_t path_index;  // 在第几级目录
    char path_now[512]; // 当前文件路径
    char path_back[512]; // 上级文件路径
};
struct file_path_info file_path_info;

typedef enum {
    SD_FILE_OTHER = 0,
    SD_FILE_AUDIO,
    SD_FILE_VIDEO,
    SD_FILE_IMAGE_JPEG,
    SD_FILE_IMAGE_PNG,
    SD_FILE_IMAGE_GIF,
    SD_FILE_TEXT,
} sd_file_type_t;

static uint8_t *s_preview_img_buf;
static lv_img_dsc_t s_preview_img_dsc;
static bool s_lv_fs_ready;

// 函数声明
esp_err_t list_sdcard_files(char * path);
static void file_list_btn_cb(lv_event_t * e); 

static const char *sd_file_ext(const char *path)
{
    const char *dot = strrchr(path, '.');
    return (dot != NULL && dot[1] != '\0') ? dot + 1 : "";
}

static bool sd_ext_is(const char *ext, const char *want)
{
    return strcasecmp(ext, want) == 0;
}

static sd_file_type_t sd_classify_file(const char *path)
{
    const char *ext = sd_file_ext(path);
    if (sd_ext_is(ext, "mp3") || sd_ext_is(ext, "wav")) {
        return SD_FILE_AUDIO;
    }
    if (sd_ext_is(ext, "mp4") || sd_ext_is(ext, "avi")) {
        return SD_FILE_VIDEO;
    }
    if (sd_ext_is(ext, "jpg") || sd_ext_is(ext, "jpeg")) {
        return SD_FILE_IMAGE_JPEG;
    }
    if (sd_ext_is(ext, "png")) {
        return SD_FILE_IMAGE_PNG;
    }
    if (sd_ext_is(ext, "gif")) {
        return SD_FILE_IMAGE_GIF;
    }
    if (sd_ext_is(ext, "txt") || sd_ext_is(ext, "log") || sd_ext_is(ext, "ini") ||
        sd_ext_is(ext, "json") || sd_ext_is(ext, "md") || sd_ext_is(ext, "csv")) {
        return SD_FILE_TEXT;
    }
    return SD_FILE_OTHER;
}

static void *sd_lv_fs_open(lv_fs_drv_t *drv, const char *path, lv_fs_mode_t mode)
{
    LV_UNUSED(drv);
    const char *flags = NULL;
    if (mode == LV_FS_MODE_WR) {
        flags = "wb";
    } else if (mode == LV_FS_MODE_RD) {
        flags = "rb";
    } else if (mode == (LV_FS_MODE_WR | LV_FS_MODE_RD)) {
        flags = "rb+";
    }
    return flags == NULL ? NULL : fopen(path, flags);
}

static lv_fs_res_t sd_lv_fs_close(lv_fs_drv_t *drv, void *file_p)
{
    LV_UNUSED(drv);
    fclose((FILE *)file_p);
    return LV_FS_RES_OK;
}

static lv_fs_res_t sd_lv_fs_read(lv_fs_drv_t *drv, void *file_p, void *buf, uint32_t btr, uint32_t *br)
{
    LV_UNUSED(drv);
    *br = fread(buf, 1, btr, (FILE *)file_p);
    return LV_FS_RES_OK;
}

static lv_fs_res_t sd_lv_fs_seek(lv_fs_drv_t *drv, void *file_p, uint32_t pos, lv_fs_whence_t whence)
{
    LV_UNUSED(drv);
    return fseek((FILE *)file_p, pos, whence) == 0 ? LV_FS_RES_OK : LV_FS_RES_UNKNOWN;
}

static lv_fs_res_t sd_lv_fs_tell(lv_fs_drv_t *drv, void *file_p, uint32_t *pos_p)
{
    LV_UNUSED(drv);
    long pos = ftell((FILE *)file_p);
    if (pos < 0) {
        return LV_FS_RES_UNKNOWN;
    }
    *pos_p = (uint32_t)pos;
    return LV_FS_RES_OK;
}

static void sd_lv_fs_init_once(void)
{
    if (s_lv_fs_ready) {
        return;
    }

    static lv_fs_drv_t fs_drv;
    lv_fs_drv_init(&fs_drv);
    fs_drv.letter = 'S';
    fs_drv.open_cb = sd_lv_fs_open;
    fs_drv.close_cb = sd_lv_fs_close;
    fs_drv.read_cb = sd_lv_fs_read;
    fs_drv.seek_cb = sd_lv_fs_seek;
    fs_drv.tell_cb = sd_lv_fs_tell;
    lv_fs_drv_register(&fs_drv);
    s_lv_fs_ready = true;
}

static bool sd_audio_player_ready(void)
{
    if (g_audio_player_ready) {
        return true;
    }

    player_config.mute_fn = _audio_player_mute_fn;
    player_config.write_fn = _audio_player_write_fn;
    player_config.clk_set_fn = _audio_player_std_clock;
    player_config.priority = 6;
    player_config.coreID = 1;

    if (audio_player_new(player_config) != ESP_OK) {
        return false;
    }
    if (audio_player_callback_register(_audio_player_callback, NULL) != ESP_OK) {
        audio_player_delete();
        return false;
    }
    g_audio_player_ready = true;
    return true;
}

static void sd_preview_cleanup(void)
{
    if (g_audio_player_ready && !g_audio_list_mode) {
        audio_player_stop();
    }
    if (sdcard_preview_page != NULL) {
        lv_obj_del(sdcard_preview_page);
        sdcard_preview_page = NULL;
    }
    if (s_preview_img_buf != NULL) {
        heap_caps_free(s_preview_img_buf);
        s_preview_img_buf = NULL;
    }
}

static void sd_preview_back_cb(lv_event_t *e)
{
    sd_preview_cleanup();
}

static lv_obj_t *sd_preview_create_page(const char *title)
{
    sd_preview_cleanup();

    sdcard_preview_page = lv_obj_create(lv_scr_act());
    lv_obj_set_size(sdcard_preview_page, 320, 240);
    lv_obj_set_style_pad_all(sdcard_preview_page, 0, 0);
    lv_obj_set_style_border_width(sdcard_preview_page, 0, 0);
    lv_obj_set_style_radius(sdcard_preview_page, 0, 0);
    lv_obj_set_style_bg_color(sdcard_preview_page, lv_color_hex(0x101820), 0);

    lv_obj_t *bar = lv_obj_create(sdcard_preview_page);
    lv_obj_set_size(bar, 320, SDCARD_PREVIEW_TOP);
    lv_obj_align(bar, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_pad_all(bar, 0, 0);
    lv_obj_set_style_border_width(bar, 0, 0);
    lv_obj_set_style_radius(bar, 0, 0);
    lv_obj_set_style_bg_color(bar, lv_color_hex(0x008b8b), 0);

    lv_obj_t *back = lv_btn_create(bar);
    lv_obj_set_size(back, 56, 34);
    lv_obj_align(back, LV_ALIGN_LEFT_MID, 2, 0);
    lv_obj_set_style_bg_opa(back, LV_OPA_TRANSP, 0);
    lv_obj_set_style_shadow_opa(back, LV_OPA_TRANSP, 0);
    lv_obj_add_event_cb(back, sd_preview_back_cb, LV_EVENT_CLICKED, NULL);

    lv_obj_t *back_label = lv_label_create(back);
    lv_label_set_text(back_label, LV_SYMBOL_LEFT);
    lv_obj_set_style_text_font(back_label, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(back_label, lv_color_hex(0xffffff), 0);
    lv_obj_center(back_label);

