xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    FILE *fp = fopen(path, "rb");
    if (fp == NULL) {
        sd_preview_message("音频播放", "文件打开失败");
        return;
    }

    g_audio_list_mode = false;
    esp_err_t ret = audio_player_play(fp);
    if (ret != ESP_OK) {
        fclose(fp);
        sd_preview_message("音频播放", "播放失败");
        return;
    }

    lvgl_port_lock(0);
    lv_obj_t *body = sd_preview_create_page("音频播放");
    lv_obj_t *symbol = lv_label_create(body);
    lv_label_set_text(symbol, LV_SYMBOL_AUDIO);
    lv_obj_set_style_text_font(symbol, &lv_font_montserrat_24, 0);
    lv_obj_set_style_text_color(symbol, lv_color_hex(0xffffff), 0);
    lv_obj_align(symbol, LV_ALIGN_CENTER, 0, -36);

    lv_obj_t *label = lv_label_create(body);
    lv_label_set_text(label, "正在播放\n返回会停止");
    lv_obj_set_style_text_font(label, &font_alipuhui20, 0);
    lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
    lv_obj_set_style_text_color(label, lv_color_hex(0xffffff), 0);
    lv_obj_align(label, LV_ALIGN_CENTER, 0, 18);
    lvgl_port_unlock();
}

static void sd_preview_file(const char *path, sd_file_type_t type)
{
    switch (type) {
    case SD_FILE_AUDIO:
        sd_preview_audio(path);
        break;
    case SD_FILE_IMAGE_JPEG:
        sd_preview_jpeg(path);
        break;
    case SD_FILE_IMAGE_PNG:
        sd_preview_png(path);
        break;
    case SD_FILE_IMAGE_GIF:
        sd_preview_gif(path);
        break;
    case SD_FILE_TEXT:
        sd_preview_text(path);
        break;
    case SD_FILE_VIDEO:
        sd_preview_message("视频文件", "暂未支持视频播放");
        break;
    default:
        sd_preview_message("文件", "暂不支持预览");
        break;
    }
}

// 返回主界面按钮事件处理函数
static void btn_sdback_cb(lv_event_t * e)
{
    if (file_path_info.path_index == 0){ // 如果当前是根目录
        sd_preview_cleanup();
        bsp_sdcard_unmount(); // 卸载SD卡
        lv_obj_del(icon_in_obj); // 回到主界面
        icon_flag = 0;
    }else{
        lv_obj_clean(sdcard_file_list); // 清除当前wifi列表
        esp_err_t ret = list_sdcard_files(file_path_info.path_back); // 列出上一级目录文件
        if (ret == ESP_OK){ // 如果成功列出目录
            strcpy(file_path_info.path_now, file_path_info.path_back); // 刚刚进入的这个目录路径 变成当前路径
            file_path_info.path_index--; // 目录级数索引退一级
            // 计算再向下退一级的目录路径
            char *slash = strrchr(file_path_info.path_back, '/'); // 从后往前查找字符'/'
            if (slash!= NULL) { // 如果查找到
                *slash = '\0'; // 替换为NULL 表示字符串结束
            }
            ESP_LOGI(TAG, "path_index: %d", file_path_info.path_index);
            ESP_LOGI(TAG, "path_now: %s", file_path_info.path_now);
            ESP_LOGI(TAG, "path_back: %s", file_path_info.path_back);
        }
    }
}

// 列出SD卡中的文件
esp_err_t list_sdcard_files(char * path) 
{
    esp_err_t ret;
    DIR *dir;
    struct dirent *ent;
    lv_obj_t * btn;
    if ((dir = opendir(path))!= NULL) { // 打开目录
        while ((ent = readdir(dir))!= NULL) { // 读取目录中的文件
            /* 常规文件处理 */
            if (ent->d_type == DT_REG){ // 如果是常规文件
                sd_file_type_t file_type = sd_classify_file(ent->d_name);
                lvgl_port_lock(0);
                switch (file_type)
                {
                case SD_FILE_AUDIO:
                    btn = lv_list_add_btn(sdcard_file_list, LV_SYMBOL_AUDIO, (const char *)ent->d_name);  // 显示音乐文件图标
                    break;
                case SD_FILE_VIDEO:
                    btn = lv_list_add_btn(sdcard_file_list, LV_SYMBOL_VIDEO, (const char *)ent->d_name);  // 显示视频文件图标
                    break;
                case SD_FILE_IMAGE_JPEG:
                case SD_FILE_IMAGE_PNG:
                case SD_FILE_IMAGE_GIF:
                    btn = lv_list_add_btn(sdcard_file_list, LV_SYMBOL_IMAGE, (const char *)ent->d_name);  // 显示图片文件图标
                    break;
                case SD_FILE_TEXT:
                    btn = lv_list_add_btn(sdcard_file_list, LV_SYMBOL_FILE, (const char *)ent->d_name);  // 显示文本文件图标
                    break;
                default:
                    btn = lv_list_add_btn(sdcard_file_list, LV_SYMBOL_FILE, (const char *)ent->d_name);  // 显示普通文件图标
                    break;
                }
                lv_obj_t *icon = lv_obj_get_child(btn, 0); // 获取图标指针
                lv_obj_set_style_text_font(icon, &lv_font_montserrat_24, 0); // 修改图标的字体    
                lv_obj_add_event_cb(btn, file_list_btn_cb, LV_EVENT_CLICKED, NULL);  // 添加点击回调函数
                lvgl_port_unlock();
            }
            /* 文件夹处理 */
            else if (ent->d_type == DT_DIR) { // 如果是文件夹
                lvgl_port_lock(0);
                btn = lv_list_add_btn(sdcard_file_list, LV_SYMBOL_DIRECTORY, (const char *)ent->d_name); 
                lv_obj_t *icon = lv_obj_get_child(btn, 0); // 获取图标指针
                lv_obj_set_style_text_font(icon, &lv_font_montserrat_24, 0); // 修改图标的字体
                lv_obj_add_event_cb(btn, file_list_btn_cb, LV_EVENT_CLICKED, NULL); // 添加点击回调函数
                lvgl_port_unlock();
            }
        }
        closedir(dir);
        ret = ESP_OK;
    } else {
        ESP_LOGE(TAG, "Failed to open directory %s.", path);
        ret = ESP_FAIL;
    }
    return ret;
}

// 文件点击 事件处理函数
static void file_list_btn_cb(lv_event_t * e)
{
    const char *file_name = NULL; // 当前文件名称
    // 获取点击的按钮名称 即文件名称
    file_name = lv_list_get_btn_text(lv_obj_get_parent(e->target), e->target);
    ESP_LOGI(TAG, "file name: %s", file_name);

    char selected_path[512];
    int written = snprintf(selected_path, sizeof(selected_path), "%s/%s", file_path_info.path_now, file_name);
    if (written <= 0 || written >= sizeof(selected_path)) {
        sd_preview_message("文件", "路径过长");
        return;
    }

    struct stat st; // 获取文件状态信息结构体
    if (stat(selected_path, &st) == 0){ // 如果成功获取到状态信息
        if (S_ISDIR(st.st_mode)){ // 如果是目录
            strcpy(file_path_info.path_back, file_path_info.path_now); // 保存上一级目录
            strcpy(file_path_info.path_now, selected_path);
            lv_obj_clean(sdcard_file_list); // 清除当前wifi列表
            esp_err_t ret = list_sdcard_files(file_path_info.path_now);
            if (ret == ESP_OK){ // 如果成功列出了目录
                file_path_info.path_index++; // 表示进入到下一集目录
                ESP_LOGI(TAG, "path_index: %d", file_path_info.path_index);
                ESP_LOGI(TAG, "path_now: %s", file_path_info.path_now);
                ESP_LOGI(TAG, "path_back: %s", file_path_info.path_back);
            } else {
                strcpy(file_path_info.path_now, file_path_info.path_back);
            }
            return;
        }

        if (S_ISREG(st.st_mode)) {
            sd_preview_file(selected_path, sd_classify_file(selected_path));
            return;
        }
    }

    sd_preview_message("文件", "无法打开");
}

