xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
// SD卡处理任务
static void task_process_sdcard(void *arg)
{
    esp_err_t ret;

    ret = bsp_sdcard_mount(); // 挂载SD卡
    if(ret != ESP_OK){ // 如果没有挂载成功
        ESP_LOGE(TAG, "Failed to mount filesystem.");
        lvgl_port_lock(0);
        lv_label_set_text(sdcard_label, "SD卡挂载不成功");
        lvgl_port_unlock();
        vTaskDelay(1000 / portTICK_PERIOD_MS); // 给上面一点显示的时间
        lvgl_port_lock(0);
        lv_obj_del(icon_in_obj);
        lvgl_port_unlock();
    }else{ // 如果挂载成功
        // 终端显示SD卡信息
        sdmmc_card_print_info(stdout, sdmmc_card);
        // 液晶屏标题栏显示SD卡容量
        lvgl_port_lock(0);
        lv_label_set_text_fmt(sdcard_label, "SD: %lluGB",
            (((uint64_t)sdmmc_card->csd.capacity) * sdmmc_card->csd.sector_size) >> 30);
        lvgl_port_unlock();

        // 创建返回按钮
        lvgl_port_lock(0);
        lv_obj_t *btn_back = lv_btn_create(sdcard_title);
        lv_obj_align(btn_back, LV_ALIGN_LEFT_MID, 0, 0);
        lv_obj_set_size(btn_back, 60, 30);
        lv_obj_set_style_border_width(btn_back, 0, 0); // 设置边框宽度
        lv_obj_set_style_pad_all(btn_back, 0, 0);  // 设置间隙
        lv_obj_set_style_bg_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN); // 背景透明
        lv_obj_set_style_shadow_opa(btn_back, LV_OPA_TRANSP, LV_PART_MAIN); // 阴影透明
        lv_obj_add_event_cb(btn_back, btn_sdback_cb, LV_EVENT_CLICKED, NULL); // 添加按键处理函数

        lv_obj_t *label_back = lv_label_create(btn_back); 
        lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
        lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
        lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
        lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

        // 创建文件列表
        sdcard_file_list = lv_list_create(icon_in_obj);
        lv_obj_set_size(sdcard_file_list, 320, 200);
        lv_obj_align(sdcard_file_list, LV_ALIGN_TOP_LEFT, 0, 40);
        lv_obj_set_style_border_width(sdcard_file_list, 0, 0);
        lv_obj_set_style_text_font(sdcard_file_list, &font_alipuhui20, 0);
        lv_obj_set_scrollbar_mode(sdcard_file_list, LV_SCROLLBAR_MODE_OFF); // 隐藏wifi_list滚动条
        lvgl_port_unlock();
        // 列出 SD 卡中的文件
        file_path_info.path_index = 0; // 表示当前在根目录
        strcpy(file_path_info.path_now, SD_MOUNT_POINT); // 装入当前路径
        list_sdcard_files(file_path_info.path_now); // 列出当前目录文件
    }
    
    vTaskDelete(NULL);
}


// 进入SD卡应用程序
static void sdcard_event_handler(lv_event_t * e)
{
    // 创建一个界面对象
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 10);  
    lv_style_set_bg_opa( &style, LV_OPA_COVER );
    lv_style_set_bg_color(&style, lv_color_hex(0xffffff));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);  
    lv_style_set_height(&style, 240); 

    icon_in_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(icon_in_obj, &style, 0);

    // 创建标题背景
    sdcard_title = lv_obj_create(icon_in_obj);
    lv_obj_set_size(sdcard_title, 320, 40);
    lv_obj_set_style_pad_all(sdcard_title, 0, 0);  // 设置间隙
    lv_obj_align(sdcard_title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_bg_color(sdcard_title, lv_color_hex(0x008b8b), 0);
    // 显示标题
    sdcard_label = lv_label_create(sdcard_title);
    lv_label_set_text(sdcard_label, "TF卡扫描中...");
    lv_obj_set_style_text_color(sdcard_label, lv_color_hex(0xffffff), 0); 
    lv_obj_set_style_text_font(sdcard_label, &font_alipuhui20, 0);
    lv_obj_align(sdcard_label, LV_ALIGN_CENTER, 0, 0);

    icon_flag = 3; // 标记已经进入第三个应用

    xTaskCreatePinnedToCore(task_process_sdcard, "task_process_sdcard", 3 * 1024, NULL, 5, NULL, 1);
}



/******************************** 第4个图标 摄像头 应用程序 *****************************************************************************/
lv_obj_t * img_camera;
lv_obj_t * camera_status_label;
static uint8_t *s_camera_display_buf;
static volatile bool s_camera_save_requested;

// 摄像头图像
lv_img_dsc_t img_camera_dsc = {
  .header.cf = LV_IMG_CF_TRUE_COLOR,
  .header.always_zero = 0,
  .header.reserved = 0,
  .header.w = 320,
  .header.h = 240,
  .data_size = 240*320*2,
};

static void camera_set_status(const char *text)
{
    if (camera_status_label == NULL) {
        return;
    }
    lvgl_port_lock(0);
    lv_label_set_text(camera_status_label, text);
    lvgl_port_unlock();
}

static void camera_save_frame(camera_fb_t *frame)
{
    camera_set_status("保存中...");

    if (bsp_sdcard_mount() != ESP_OK) {
        camera_set_status("TF卡不可用");
        return;
    }

    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/photos", 0775);

    uint8_t *jpg_buf = NULL;
    size_t jpg_len = 0;
    bool ok = frame2jpg(frame, 80, &jpg_buf, &jpg_len);
    if (!ok || jpg_buf == NULL || jpg_len == 0) {
        camera_set_status("编码失败");
        return;
    }

    char path[128];
    snprintf(path, sizeof(path), SD_MOUNT_POINT "/szpi/photos/photo_%lld.jpg", esp_timer_get_time() / 1000);
    FILE *f = fopen(path, "wb");
    if (f == NULL) {
        free(jpg_buf);
        camera_set_status("保存失败");
        return;
    }

    size_t written = fwrite(jpg_buf, 1, jpg_len, f);
    fclose(f);
    free(jpg_buf);
    camera_set_status(written == jpg_len ? "已保存到TF卡" : "写入失败");
}

// 摄像头处理任务
static void task_process_camera(void *arg)
{
    bool camera_started = false;
    const size_t frame_bytes = 240 * 320 * 2;
    if (s_camera_display_buf == NULL) {
        s_camera_display_buf = heap_caps_malloc(frame_bytes, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
    }
    if (s_camera_display_buf == NULL) {
        camera_set_status("显示缓冲不足");
        icon_flag = 0;
        goto cleanup;
    }

    memset(s_camera_display_buf, 0xff, frame_bytes);
    img_camera_dsc.data = s_camera_display_buf;
    lvgl_port_lock(0);
    if (img_camera != NULL) {
        lv_img_set_src(img_camera, &img_camera_dsc);
    }
    lvgl_port_unlock();

    camera_set_status("摄像头启动中...");
    esp_err_t ret = bsp_camera_init();
    if (ret != ESP_OK) {
        char msg[48];
        snprintf(msg, sizeof(msg), "摄像头失败:%s", esp_err_to_name(ret));
        camera_set_status(msg);
        vTaskDelay(pdMS_TO_TICKS(1200));
        icon_flag = 0;
        goto cleanup;
    }

