xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
typedef struct {
    char ssid[33];
    char password[65];
    wifi_auth_mode_t authmode;
} wifi_saved_network_t;

static wifi_saved_network_t s_wifi_history[WIFI_HISTORY_MAX];
static size_t s_wifi_history_count;
static bool s_wifi_history_loaded;
static wifi_ap_record_t s_wifi_ap_records[DEFAULT_SCAN_LIST_SIZE];
static uint16_t s_wifi_ap_count;
static bool s_wifi_handlers_registered;
static bool s_wifi_driver_started;
static int s_wifi_retry_num;

static char *wifi_trim(char *text)
{
    if (text == NULL) {
        return NULL;
    }

    while (*text != '\0' && isspace((unsigned char)*text)) {
        text++;
    }

    char *end = text + strlen(text);
    while (end > text && isspace((unsigned char)end[-1])) {
        *--end = '\0';
    }
    return text;
}

static void wifi_history_upsert(const char *ssid, const char *password, wifi_auth_mode_t authmode)
{
    if (ssid == NULL || ssid[0] == '\0') {
        return;
    }

    for (size_t i = 0; i < s_wifi_history_count; i++) {
        if (strcmp(s_wifi_history[i].ssid, ssid) == 0) {
            snprintf(s_wifi_history[i].password, sizeof(s_wifi_history[i].password), "%s", password ? password : "");
            s_wifi_history[i].authmode = authmode;
            return;
        }
    }

    if (s_wifi_history_count >= WIFI_HISTORY_MAX) {
        memmove(&s_wifi_history[0], &s_wifi_history[1], sizeof(s_wifi_history[0]) * (WIFI_HISTORY_MAX - 1));
        s_wifi_history_count = WIFI_HISTORY_MAX - 1;
    }

    snprintf(s_wifi_history[s_wifi_history_count].ssid, sizeof(s_wifi_history[s_wifi_history_count].ssid), "%s", ssid);
    snprintf(s_wifi_history[s_wifi_history_count].password, sizeof(s_wifi_history[s_wifi_history_count].password), "%s", password ? password : "");
    s_wifi_history[s_wifi_history_count].authmode = authmode;
    s_wifi_history_count++;
}

static const wifi_saved_network_t *wifi_history_find(const char *ssid)
{
    if (ssid == NULL) {
        return NULL;
    }

    for (size_t i = 0; i < s_wifi_history_count; i++) {
        if (strcmp(s_wifi_history[i].ssid, ssid) == 0) {
            return &s_wifi_history[i];
        }
    }
    return NULL;
}

static void wifi_history_commit_entry(char *ssid, char *password, wifi_auth_mode_t authmode)
{
    if (ssid[0] != '\0') {
        wifi_history_upsert(ssid, password, authmode);
    }
    ssid[0] = '\0';
    password[0] = '\0';
}

static void wifi_history_load(void)
{
    if (s_wifi_history_loaded) {
        return;
    }

    s_wifi_history_loaded = true;
    s_wifi_history_count = 0;

    if (bsp_sdcard_mount() != ESP_OK) {
        return;
    }

    FILE *f = fopen(WIFI_HISTORY_PATH, "r");
    if (f == NULL) {
        return;
    }

    char line[160];
    char ssid[33] = {0};
    char password[65] = {0};
    wifi_auth_mode_t authmode = WIFI_AUTH_WPA2_PSK;

    while (fgets(line, sizeof(line), f) != NULL) {
        char *text = wifi_trim(line);
        if (text[0] == '\0' || text[0] == '#') {
            continue;
        }
        if (strcmp(text, "[network]") == 0) {
            wifi_history_commit_entry(ssid, password, authmode);
            authmode = WIFI_AUTH_WPA2_PSK;
            continue;
        }

        char *eq = strchr(text, '=');
        if (eq == NULL) {
            continue;
        }
        *eq = '\0';
        char *key = wifi_trim(text);
        char *value = wifi_trim(eq + 1);
        if (strcmp(key, "ssid") == 0) {
            snprintf(ssid, sizeof(ssid), "%s", value);
        } else if (strcmp(key, "password") == 0) {
            snprintf(password, sizeof(password), "%s", value);
        } else if (strcmp(key, "auth") == 0) {
            authmode = (wifi_auth_mode_t)atoi(value);
        }
    }

    wifi_history_commit_entry(ssid, password, authmode);
    fclose(f);
}

static void wifi_history_save_all(void)
{
    if (bsp_sdcard_mount() != ESP_OK) {
        return;
    }

    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/config", 0775);

    FILE *f = fopen(WIFI_HISTORY_PATH, "w");
    if (f == NULL) {
        return;
    }

    fprintf(f, "# SZPI WLAN history\n");
    for (size_t i = 0; i < s_wifi_history_count; i++) {
        fprintf(f, "[network]\nssid=%s\npassword=%s\nauth=%d\n",
                s_wifi_history[i].ssid,
                s_wifi_history[i].password,
                (int)s_wifi_history[i].authmode);
    }
    fclose(f);
}

static void wifi_save_random_image_config(const char *ssid, const char *password)
{
    if (bsp_sdcard_mount() != ESP_OK) {
        return;
    }

    mkdir(SD_MOUNT_POINT "/szpi", 0775);
    mkdir(SD_MOUNT_POINT "/szpi/config", 0775);

    FILE *f = fopen(RANDOM_WIFI_CONFIG_PATH, "w");
    if (f == NULL) {
        return;
    }
    fprintf(f,
            "# Used by random image app. Edit on your computer if needed.\n"
            "ssid=%s\n"
            "password=%s\n"
            "api=%s\n",
            ssid ? ssid : "",
            password ? password : "",
            CONFIG_RANDOM_IMAGE_API_URL);
    fclose(f);
}

static wifi_auth_mode_t wifi_find_authmode(const char *ssid)
{
    if (ssid == NULL) {
        return WIFI_AUTH_WPA2_PSK;
    }

    for (uint16_t i = 0; i < s_wifi_ap_count; i++) {
        if (strcmp((const char *)s_wifi_ap_records[i].ssid, ssid) == 0) {
            return s_wifi_ap_records[i].authmode;
        }
    }
    return WIFI_AUTH_WPA2_PSK;
}

static bool wifi_auth_is_open(wifi_auth_mode_t authmode)
{
    return authmode == WIFI_AUTH_OPEN;
}

// 密码roller的遮罩显示效果
static void mask_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t * obj = lv_event_get_target(e);

    static int16_t mask_top_id = -1;
    static int16_t mask_bottom_id = -1;

    if(code == LV_EVENT_COVER_CHECK) {
        lv_event_set_cover_res(e, LV_COVER_RES_MASKED);
    }
    else if(code == LV_EVENT_DRAW_MAIN_BEGIN) {
        /* add mask */
        const lv_font_t * font = lv_obj_get_style_text_font(obj, LV_PART_MAIN);
        lv_coord_t line_space = lv_obj_get_style_text_line_space(obj, LV_PART_MAIN);
        lv_coord_t font_h = lv_font_get_line_height(font);

        lv_area_t roller_coords;
        lv_obj_get_coords(obj, &roller_coords);

        lv_area_t rect_area;
        rect_area.x1 = roller_coords.x1;
        rect_area.x2 = roller_coords.x2;
        rect_area.y1 = roller_coords.y1;
        rect_area.y2 = roller_coords.y1 + (lv_obj_get_height(obj) - font_h - line_space) / 2;

