xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    lv_obj_t *label_back = lv_label_create(btn_ble_back); 
    lv_label_set_text(label_back, LV_SYMBOL_LEFT);  // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0); 
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    esp_err_t ret = app_hid_ctrl();
    if (ret == ESP_OK) {
        lv_label_set_text(ble_label, "BLE HID Ready");
    } else {
        lv_label_set_text_fmt(ble_label, "BLE失败:%s", esp_err_to_name(ret));
    }

    icon_flag = 6; // 标记已经进入第6个应用
}


/******************************** 主界面  ******************************/

LV_IMG_DECLARE(img_att_icon);
LV_IMG_DECLARE(img_music_icon);
LV_IMG_DECLARE(img_sd_icon);
LV_IMG_DECLARE(img_camera_icon);
LV_IMG_DECLARE(img_wifiset_icon);
LV_IMG_DECLARE(img_btset_icon);

#define HOME_ITEMS_PER_PAGE 4

typedef enum {
    HOME_ICON_SYMBOL,
    HOME_ICON_IMAGE,
} home_icon_type_t;

typedef struct {
    const char *title;
    const char *subtitle;
    uint32_t color_hex;
    home_icon_type_t icon_type;
    const void *icon_src;
    void (*event_cb)(lv_event_t *e);
} home_app_item_t;

static lv_obj_t *s_home_icon_layer;
static lv_obj_t *s_home_page_label;
static uint8_t s_home_page_index;
static bool s_home_styles_ready;
static bool s_home_launch_locked;
static bool s_home_button_task_started;
static lv_style_t s_home_bg_style;
static lv_style_t s_home_button_style;
static lv_style_t s_home_button_pressed_style;

static const home_app_item_t s_home_apps[] = {
    { "随机图", "API",    0x2fa66a, HOME_ICON_SYMBOL, LV_SYMBOL_IMAGE,   random_image_app_event_handler },
    { "姿态",   "QMI8658", 0xf06d2f, HOME_ICON_IMAGE,  &img_att_icon,     att_event_handler },
    { "音乐",   "Player", 0x4c7bd9, HOME_ICON_IMAGE,  &img_music_icon,   music_event_handler },
    { "TF卡",   "Files",  0x009688, HOME_ICON_IMAGE,  &img_sd_icon,      sdcard_event_handler },
    { "摄像头", "Camera", 0xd8a318, HOME_ICON_IMAGE,  &img_camera_icon,  camera_event_handler },
    { "WLAN",   "Scan",   0xc85a5a, HOME_ICON_IMAGE,  &img_wifiset_icon, wifiset_event_handler },
    { "蓝牙",   "HID",    0xa36bb8, HOME_ICON_IMAGE,  &img_btset_icon,   btset_event_handler },
};

static uint8_t home_page_count(void)
{
    return (sizeof(s_home_apps) / sizeof(s_home_apps[0]) + HOME_ITEMS_PER_PAGE - 1) / HOME_ITEMS_PER_PAGE;
}

static void home_styles_init(void)
{
    if (s_home_styles_ready) {
        return;
    }

    lv_style_init(&s_home_bg_style);
    lv_style_set_radius(&s_home_bg_style, 0);
    lv_style_set_bg_opa(&s_home_bg_style, LV_OPA_COVER);
    lv_style_set_bg_color(&s_home_bg_style, lv_color_hex(0x111820));
    lv_style_set_bg_grad_color(&s_home_bg_style, lv_color_hex(0x24313a));
    lv_style_set_bg_grad_dir(&s_home_bg_style, LV_GRAD_DIR_VER);
    lv_style_set_border_width(&s_home_bg_style, 0);
    lv_style_set_pad_all(&s_home_bg_style, 0);
    lv_style_set_width(&s_home_bg_style, 320);
    lv_style_set_height(&s_home_bg_style, 240);

    lv_style_init(&s_home_button_style);
    lv_style_set_radius(&s_home_button_style, 10);
    lv_style_set_bg_opa(&s_home_button_style, LV_OPA_COVER);
    lv_style_set_border_width(&s_home_button_style, 0);
    lv_style_set_shadow_width(&s_home_button_style, 0);
    lv_style_set_pad_all(&s_home_button_style, 0);
    lv_style_set_text_color(&s_home_button_style, lv_color_hex(0xffffff));

    lv_style_init(&s_home_button_pressed_style);
    lv_style_set_bg_opa(&s_home_button_pressed_style, LV_OPA_80);

    s_home_styles_ready = true;
}

static void home_render_page(void);

static void home_unlock_launch_cb(lv_timer_t *timer)
{
    s_home_launch_locked = false;
    lv_timer_del(timer);
}

static void home_app_clicked_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_CLICKED) {
        return;
    }
    if (s_home_launch_locked || icon_flag != 0) {
        return;
    }

    const home_app_item_t *app = (const home_app_item_t *)lv_event_get_user_data(e);
    if (app == NULL || app->event_cb == NULL) {
        return;
    }

    s_home_launch_locked = true;
    lv_timer_t *unlock_timer = lv_timer_create(home_unlock_launch_cb, 1200, NULL);
    lv_timer_set_repeat_count(unlock_timer, 1);
    app->event_cb(e);
}

static void home_switch_page(int delta)
{
    int page_count = (int)home_page_count();
    if (page_count <= 1) {
        return;
    }

    int next = ((int)s_home_page_index + delta) % page_count;
    if (next < 0) {
        next += page_count;
    }

    if (next == s_home_page_index) {
        return;
    }

    s_home_page_index = (uint8_t)next;
    home_render_page();
}

static void home_button_next_page_cb(void *arg)
{
    if (icon_flag == 0 && s_home_icon_layer != NULL) {
        home_switch_page(1);
    }
}

static void home_button_task(void *arg)
{
    gpio_num_t key_gpio = CONFIG_RANDOM_IMAGE_REFRESH_GPIO;
    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << key_gpio,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io_conf);

    int last_level = 1;
    int64_t press_start_us = 0;

    while (true) {
        int level = gpio_get_level(key_gpio);
        int64_t now_us = esp_timer_get_time();
        if (last_level == 1 && level == 0) {
            press_start_us = now_us;
        } else if (last_level == 0 && level == 1 && press_start_us > 0) {
            int64_t held_us = now_us - press_start_us;
            if (held_us > 30000 && held_us < 2000000 && icon_flag == 0) {
                lv_async_call(home_button_next_page_cb, NULL);
            }
            press_start_us = 0;
        }
        last_level = level;
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

static void home_ensure_button_task(void)
{
    if (s_home_button_task_started) {
        return;
    }

    BaseType_t ok = xTaskCreatePinnedToCore(home_button_task, "home_button", 4 * 1024, NULL, 4, NULL, 1);
    if (ok == pdPASS) {
        s_home_button_task_started = true;
    } else {
        ESP_LOGE(TAG, "create home_button task failed");
    }
}

static void home_gesture_cb(lv_event_t *e)
{
    if (lv_event_get_code(e) != LV_EVENT_GESTURE) {
        return;
    }

    lv_indev_t *indev = lv_indev_get_act();
    if (indev == NULL) {
        return;
    }

    lv_dir_t dir = lv_indev_get_gesture_dir(indev);
    if (dir == LV_DIR_LEFT) {
        home_switch_page(1);
    } else if (dir == LV_DIR_RIGHT) {
        home_switch_page(-1);
    }
}

static void home_create_icon(const home_app_item_t *app, uint8_t slot)
{
    static const lv_coord_t x_pos[2] = { 8, 164 };
    static const lv_coord_t y_pos[2] = { 50, 136 };
    uint8_t col = slot % 2;
    uint8_t row = slot / 2;

    lv_obj_t *btn = lv_btn_create(s_home_icon_layer);
    lv_obj_add_style(btn, &s_home_button_style, 0);
    lv_obj_add_style(btn, &s_home_button_pressed_style, LV_STATE_PRESSED);
    lv_obj_set_style_bg_color(btn, lv_color_hex(app->color_hex), 0);
    lv_obj_set_size(btn, 148, 76);
    lv_obj_set_pos(btn, x_pos[col], y_pos[row] - 45);
    lv_obj_clear_flag(btn, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_flag(btn, LV_OBJ_FLAG_GESTURE_BUBBLE);
    lv_obj_add_event_cb(btn, home_app_clicked_cb, LV_EVENT_CLICKED, (void *)app);
    lv_obj_add_event_cb(btn, home_gesture_cb, LV_EVENT_GESTURE, NULL);

