xiwangly2/szpi-esp32s3-handheld/firmware/handheld/main/app_ui.c
    if (app->icon_type == HOME_ICON_IMAGE) {
        lv_obj_t *img = lv_img_create(btn);
        lv_img_set_src(img, app->icon_src);
        lv_img_set_zoom(img, 192);
        lv_obj_align(img, LV_ALIGN_LEFT_MID, 7, 0);
    } else {
        lv_obj_t *symbol = lv_label_create(btn);
        lv_label_set_text(symbol, (const char *)app->icon_src);
        lv_obj_set_style_text_font(symbol, &lv_font_montserrat_24, 0);
        lv_obj_set_style_text_color(symbol, lv_color_hex(0xffffff), 0);
        lv_obj_align(symbol, LV_ALIGN_LEFT_MID, 24, 0);
    }

    lv_obj_t *title = lv_label_create(btn);
    lv_label_set_text(title, app->title);
    lv_obj_set_style_text_font(title, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(title, lv_color_hex(0xffffff), 0);
    lv_obj_set_width(title, 68);
    lv_obj_align(title, LV_ALIGN_LEFT_MID, 76, -12);

    lv_obj_t *subtitle = lv_label_create(btn);
    lv_label_set_text(subtitle, app->subtitle);
    lv_obj_set_style_text_font(subtitle, &lv_font_montserrat_14, 0);
    lv_obj_set_style_text_color(subtitle, lv_color_hex(0xf2f5f8), 0);
    lv_obj_set_style_text_opa(subtitle, LV_OPA_80, 0);
    lv_obj_set_width(subtitle, 68);
    lv_obj_align(subtitle, LV_ALIGN_LEFT_MID, 76, 15);
}

static void home_render_page(void)
{
    if (s_home_icon_layer == NULL) {
        return;
    }

    lv_obj_clean(s_home_icon_layer);

    uint8_t first = s_home_page_index * HOME_ITEMS_PER_PAGE;
    uint8_t app_count = sizeof(s_home_apps) / sizeof(s_home_apps[0]);
    for (uint8_t slot = 0; slot < HOME_ITEMS_PER_PAGE; slot++) {
        uint8_t app_index = first + slot;
        if (app_index >= app_count) {
            break;
        }
        home_create_icon(&s_home_apps[app_index], slot);
    }

    if (s_home_page_label != NULL) {
        lv_label_set_text_fmt(s_home_page_label, "%d/%d", s_home_page_index + 1, home_page_count());
    }
}

void lv_main_page(void)
{
    lvgl_port_lock(0);

    home_styles_init();
    lv_obj_set_style_bg_color(lv_scr_act(), lv_color_hex(0x000000), 0);

    main_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(main_obj, &s_home_bg_style, 0);
    lv_obj_clear_flag(main_obj, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_event_cb(main_obj, home_gesture_cb, LV_EVENT_GESTURE, NULL);

    lv_obj_t *top_line = lv_obj_create(main_obj);
    lv_obj_set_size(top_line, 320, 1);
    lv_obj_set_pos(top_line, 0, 39);
    lv_obj_set_style_pad_all(top_line, 0, 0);
    lv_obj_set_style_border_width(top_line, 0, 0);
    lv_obj_set_style_bg_color(top_line, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_bg_opa(top_line, LV_OPA_20, 0);

    // 显示右上角符号
    lv_obj_t * sylbom_label = lv_label_create(main_obj);
    lv_obj_set_style_text_font(sylbom_label, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(sylbom_label, lv_color_hex(0xffffff), 0);
    lv_label_set_text(sylbom_label, LV_SYMBOL_BLUETOOTH" "LV_SYMBOL_WIFI);
    lv_obj_align_to(sylbom_label, main_obj, LV_ALIGN_TOP_RIGHT, -10, 10);

    // 显示左上角欢迎语
    main_text_label = lv_label_create(main_obj);
    lv_obj_set_style_text_font(main_text_label, &font_alipuhui20, 0);
    lv_obj_set_style_text_color(main_text_label, lv_color_hex(0xffffff), 0);
    lv_label_set_long_mode(main_text_label, LV_LABEL_LONG_SCROLL_CIRCULAR);
    lv_obj_set_width(main_text_label, 215);
    lv_label_set_text(main_text_label, "SZPI-S3 掌机");
    lv_obj_align_to(main_text_label, main_obj, LV_ALIGN_TOP_LEFT, 10, 6);

    s_home_icon_layer = lv_obj_create(main_obj);
    lv_obj_set_size(s_home_icon_layer, 320, 176);
    lv_obj_set_pos(s_home_icon_layer, 0, 45);
    lv_obj_set_style_pad_all(s_home_icon_layer, 0, 0);
    lv_obj_set_style_border_width(s_home_icon_layer, 0, 0);
    lv_obj_set_style_radius(s_home_icon_layer, 0, 0);
    lv_obj_set_style_bg_opa(s_home_icon_layer, LV_OPA_TRANSP, 0);
    lv_obj_clear_flag(s_home_icon_layer, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_event_cb(s_home_icon_layer, home_gesture_cb, LV_EVENT_GESTURE, NULL);

    s_home_page_label = lv_label_create(main_obj);
    lv_obj_set_style_text_font(s_home_page_label, &lv_font_montserrat_14, 0);
    lv_obj_set_style_text_color(s_home_page_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_text_opa(s_home_page_label, LV_OPA_70, 0);
    lv_obj_align(s_home_page_label, LV_ALIGN_BOTTOM_MID, 0, -7);

    s_home_page_index = 0;
    home_render_page();
    home_ensure_button_task();

    icon_flag = 0;
    lvgl_port_unlock();
}

